# ####################################################################

#  Created by Genus(TM) Synthesis Solution GENUS15.22 - 15.20-s024_1 on Tue Jun 17 17:14:12 -0300 2025

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design USFFT64_2B

create_clock -name "clk" -add -period 6.67 -waveform {0.0 3.335} [get_ports CLK]
set_clock_gating_check -setup 0.0 
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports RDY]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports OVF1]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports OVF2]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {ADDR[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {ADDR[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {ADDR[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {ADDR[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {ADDR[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {ADDR[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOR[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {DOI[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports dft_scan_output_1]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports dft_scan_output_2]
set_max_fanout 8.000 [current_design]
set_input_transition 0.2 [get_ports CLK]
set_input_transition 0.2 [get_ports RST]
set_input_transition 0.2 [get_ports ED]
set_input_transition 0.2 [get_ports START]
set_input_transition 0.2 [get_ports {SHIFT[3]}]
set_input_transition 0.2 [get_ports {SHIFT[2]}]
set_input_transition 0.2 [get_ports {SHIFT[1]}]
set_input_transition 0.2 [get_ports {SHIFT[0]}]
set_input_transition 0.2 [get_ports {DR[15]}]
set_input_transition 0.2 [get_ports {DR[14]}]
set_input_transition 0.2 [get_ports {DR[13]}]
set_input_transition 0.2 [get_ports {DR[12]}]
set_input_transition 0.2 [get_ports {DR[11]}]
set_input_transition 0.2 [get_ports {DR[10]}]
set_input_transition 0.2 [get_ports {DR[9]}]
set_input_transition 0.2 [get_ports {DR[8]}]
set_input_transition 0.2 [get_ports {DR[7]}]
set_input_transition 0.2 [get_ports {DR[6]}]
set_input_transition 0.2 [get_ports {DR[5]}]
set_input_transition 0.2 [get_ports {DR[4]}]
set_input_transition 0.2 [get_ports {DR[3]}]
set_input_transition 0.2 [get_ports {DR[2]}]
set_input_transition 0.2 [get_ports {DR[1]}]
set_input_transition 0.2 [get_ports {DR[0]}]
set_input_transition 0.2 [get_ports {DI[15]}]
set_input_transition 0.2 [get_ports {DI[14]}]
set_input_transition 0.2 [get_ports {DI[13]}]
set_input_transition 0.2 [get_ports {DI[12]}]
set_input_transition 0.2 [get_ports {DI[11]}]
set_input_transition 0.2 [get_ports {DI[10]}]
set_input_transition 0.2 [get_ports {DI[9]}]
set_input_transition 0.2 [get_ports {DI[8]}]
set_input_transition 0.2 [get_ports {DI[7]}]
set_input_transition 0.2 [get_ports {DI[6]}]
set_input_transition 0.2 [get_ports {DI[5]}]
set_input_transition 0.2 [get_ports {DI[4]}]
set_input_transition 0.2 [get_ports {DI[3]}]
set_input_transition 0.2 [get_ports {DI[2]}]
set_input_transition 0.2 [get_ports {DI[1]}]
set_input_transition 0.2 [get_ports {DI[0]}]
set_input_transition 0.2 [get_ports dft_shift_enable]
set_input_transition 0.2 [get_ports dft_scan_input_1]
set_input_transition 0.2 [get_ports dft_scan_input_2]
set_wire_load_selection_group "4_metls_routing" -library "D_CELLS_MOSST_fast_1_98V_m40C"
set_dont_use [get_lib_cells AN322X0]
set_dont_use [get_lib_cells AN322X1]
set_dont_use [get_lib_cells AN331X0]
set_dont_use [get_lib_cells AN331X1]
set_dont_use [get_lib_cells AN332X0]
set_dont_use [get_lib_cells AN332X1]
set_dont_use [get_lib_cells AN333X0]
set_dont_use [get_lib_cells AN333X1]
set_dont_use [get_lib_cells AND7X0]
set_dont_use [get_lib_cells AND7X1]
set_dont_use [get_lib_cells AND8X0]
set_dont_use [get_lib_cells AND8X1]
set_dont_use [get_lib_cells ANTENNACELL10]
set_dont_use [get_lib_cells ANTENNACELL2]
set_dont_use [get_lib_cells ANTENNACELL25]
set_dont_use [get_lib_cells ANTENNACELL5]
set_dont_use [get_lib_cells ANTENNACELLN10]
set_dont_use [get_lib_cells ANTENNACELLN2]
set_dont_use [get_lib_cells ANTENNACELLN25]
set_dont_use [get_lib_cells ANTENNACELLN5]
set_dont_use [get_lib_cells AO322X0]
set_dont_use [get_lib_cells AO322X1]
set_dont_use [get_lib_cells AO331X0]
set_dont_use [get_lib_cells AO331X1]
set_dont_use [get_lib_cells AO332X0]
set_dont_use [get_lib_cells AO332X1]
set_dont_use [get_lib_cells AO333X0]
set_dont_use [get_lib_cells AO333X1]
set_dont_use [get_lib_cells LGCNX0]
set_dont_use [get_lib_cells LGCNX1]
set_dont_use [get_lib_cells LGCNX2]
set_dont_use [get_lib_cells LGCNX3]
set_dont_use [get_lib_cells LGCNX4]
set_dont_use [get_lib_cells LGCNX6]
set_dont_use [get_lib_cells LGCNX8]
set_dont_use [get_lib_cells LGCPX0]
set_dont_use [get_lib_cells LGCPX1]
set_dont_use [get_lib_cells LGCPX2]
set_dont_use [get_lib_cells LGCPX3]
set_dont_use [get_lib_cells LGCPX4]
set_dont_use [get_lib_cells LGCPX6]
set_dont_use [get_lib_cells LGCPX8]
set_dont_use [get_lib_cells LSGCNX0]
set_dont_use [get_lib_cells LSGCNX1]
set_dont_use [get_lib_cells LSGCNX2]
set_dont_use [get_lib_cells LSGCNX3]
set_dont_use [get_lib_cells LSGCNX4]
set_dont_use [get_lib_cells LSGCNX6]
set_dont_use [get_lib_cells LSGCNX8]
set_dont_use [get_lib_cells LSGCPX0]
set_dont_use [get_lib_cells LSGCPX1]
set_dont_use [get_lib_cells LSGCPX2]
set_dont_use [get_lib_cells LSGCPX3]
set_dont_use [get_lib_cells LSGCPX4]
set_dont_use [get_lib_cells LSGCPX6]
set_dont_use [get_lib_cells LSGCPX8]
set_dont_use [get_lib_cells LSOGCNX0]
set_dont_use [get_lib_cells LSOGCNX1]
set_dont_use [get_lib_cells LSOGCNX2]
set_dont_use [get_lib_cells LSOGCNX3]
set_dont_use [get_lib_cells LSOGCNX4]
set_dont_use [get_lib_cells LSOGCNX6]
set_dont_use [get_lib_cells LSOGCNX8]
set_dont_use [get_lib_cells LSOGCPX0]
set_dont_use [get_lib_cells LSOGCPX1]
set_dont_use [get_lib_cells LSOGCPX2]
set_dont_use [get_lib_cells LSOGCPX3]
set_dont_use [get_lib_cells LSOGCPX4]
set_dont_use [get_lib_cells LSOGCPX6]
set_dont_use [get_lib_cells LSOGCPX8]
set_dont_use [get_lib_cells NA7X0]
set_dont_use [get_lib_cells NA7X1]
set_dont_use [get_lib_cells NA8X0]
set_dont_use [get_lib_cells NA8X1]
set_dont_use [get_lib_cells NO7X0]
set_dont_use [get_lib_cells NO7X1]
set_dont_use [get_lib_cells NO8X0]
set_dont_use [get_lib_cells NO8X1]
set_dont_use [get_lib_cells OA322X0]
set_dont_use [get_lib_cells OA322X1]
set_dont_use [get_lib_cells OA331X0]
set_dont_use [get_lib_cells OA331X1]
set_dont_use [get_lib_cells OA332X0]
set_dont_use [get_lib_cells OA332X1]
set_dont_use [get_lib_cells OA333X0]
set_dont_use [get_lib_cells OA333X1]
set_dont_use [get_lib_cells ON322X0]
set_dont_use [get_lib_cells ON322X1]
set_dont_use [get_lib_cells ON331X0]
set_dont_use [get_lib_cells ON331X1]
set_dont_use [get_lib_cells ON332X0]
set_dont_use [get_lib_cells ON332X1]
set_dont_use [get_lib_cells ON333X0]
set_dont_use [get_lib_cells ON333X1]
set_dont_use [get_lib_cells OR7X0]
set_dont_use [get_lib_cells OR7X1]
set_dont_use [get_lib_cells OR8X0]
set_dont_use [get_lib_cells OR8X1]
set_dont_use [get_lib_cells SIGNALHOLD]
set_dont_use [get_lib_cells FEED1]
set_dont_use [get_lib_cells FEED2]
set_dont_use [get_lib_cells FEED5]
set_dont_use [get_lib_cells FEED10]
set_dont_use [get_lib_cells FEED25]
set_dont_use [get_lib_cells FEEDCAP2]
set_dont_use [get_lib_cells FEEDCAP5]
set_dont_use [get_lib_cells FEEDCAP5LP]
set_dont_use [get_lib_cells FEEDCAP7]
set_dont_use [get_lib_cells FEEDCAP7LP]
set_dont_use [get_lib_cells FEEDCAP10]
set_dont_use [get_lib_cells FEEDCAP10LP]
set_dont_use [get_lib_cells FEEDCAP15]
set_dont_use [get_lib_cells FEEDCAP15LP]
set_dont_use [get_lib_cells FEEDCAP25]
set_dont_use [get_lib_cells FEEDCAP25LP]
set_clock_uncertainty -setup 0.4 [get_clocks clk]
set_clock_uncertainty -hold 0.4 [get_clocks clk]
